fun main(args: Array<String>) {
    val likes = 1051

    // понравилось - кому?
    // человеку - 1, 21, 31 ... 101, 121 ... 1001, 1021 ... 20001 - заканчивается на 1, кроме окончания на 11
    // людей - 1000, 2000, 3000 .... 10000 .... 20000 .... 1 000 000 - делится на 1000 без остатка
    // людям - 2-10, 11-20, 22-30 ... 102-110, 111-120 ... 1002-1010, 1011-1020 - все остальные случаи

    var result = "людям"
    if (((likes % 10) == 1) && ((likes % 100) != 11)) result = "человеку"
    if ((likes % 1000) == 0) result = "людей"

    println(result)
}